program m;

uses
  graphabc;

var
  i, j: integer;

begin
  setwindowsize(960, 800); //Окно
  line(960, 0, 960, 1890);
  line(0, 0, 0, 1890);
  line(0, 470, 961, 470);
  floodfill(100, 100, cllightblue); //Небо
  floodfill(100, 700, clwhite); //Снег
  for i := 1 to 1000 do
  begin
    lockdrawing;
    clearwindow; //Очистка окна
    //Ракета
    setpencolor(clpurple); //Контур ракеты
    setbrushcolor(clpink); //Заливка кистью
    //Форма
    circle(600, 400, 50); //Правый двигатель
    circle(500, 400, 50); //Левый двигатель
    ellipse(500, 100, 600, 430); //Космический аппарат
    //Отделение на корпусы
    line(550, 100, 550, 150); //Прямая на ракете, по y
    line(515, 150, 585, 150); //Прямая на ракете, по x
    
    //Солнышко
    setbrushcolor(clyellow); //Заливка сознышка
    setpencolor(clorange); //Контур солнышка
    circle(850, 50, 150); //Круг
    line(560, 10, 702, 25); //Лучик 1
    line(600, 150, 709, 100); //Лучик 2
    line(680, 275, 773, 178); //Лучик 3
    line(860, 200, 840, 320); //Лучик 3
    
    //Снеговичок
    setpenwidth(3); //Шрифт
    setbrushcolor(clwhite); //Заливка кистью
    setpencolor(clblack); //Контур снеговика
    //Контур снеговика
    ellipse(120, 350, 280, 480); //3 шар
    circle(200, 300, 60); //2 шар
    circle(200, 210, 40); //1 шар ... Голова
    //Дело в шляпе
    line(170, 90, 230, 90); //Крыша
    line(160, 180, 240, 180); //Днише
    line(170, 90, 160, 180); //Лево
    line(230, 90, 240, 180); //Право
    floodfill(200, 173, clblack); //Заливка шляпы
    floodfill(200, 123, clblack); //Заливка шляпы
    //Глаза
    setbrushcolor(clblack); //Заливка глаз
    circle(190, 200, 3); //Левый
    circle(210, 200, 3); //Правый
    //Нос
    line(200, 210, 220, 220); //Гипотинуза
    line(200, 220, 220, 220); //Ось x
    line(200, 210, 200, 220); //Ось y
    //Рот
    setpenwidth(5); //Ширина рта
    arc(200, 235, 10, 190, 0); //Дуга
    //Руки
    line(450, 420, 170, 250); //Левая
    line(230, 250, 480, 300); //Правая
    //Правая кисть
    line(480, 300, 515, 305);
    line(480, 300, 515, 315);
    line(480, 300, 515, 325);
    line(480, 300, 515, 295);
    line(480, 300, 515, 285);
    //Левая кисть
    line(450, 420, 490, 425);
    line(450, 420, 490, 435);
    line(450, 420, 490, 445);
    line(450, 420, 490, 415);
    line(450, 420, 490, 405);
    
    //Сугробы
    setbrushcolor(clwhite);
    arc(20, 530, 65, 135, 50);
    arc(105, 530, 65, 135, 50);
    arc(190, 530, 65, 135, 50);
    arc(275, 530, 65, 135, 50);
    arc(360, 530, 65, 135, 50);
    arc(445, 530, 65, 135, 50);
    arc(525, 530, 65, 135, 50);
    arc(605, 530, 65, 135, 50);
    arc(685, 530, 65, 135, 50);
    arc(765, 530, 65, 135, 50);
    arc(845, 530, 65, 135, 50);
    arc(925, 530, 65, 135, 50);
    
    for j := 1 to 100 do
    begin
      circle(random(1000), random(450), 1);
    end;
    sleep(100);
    redraw //Oсуществляет перерисовку окна
  end;
end.